re34/Front_UIShow/bsp/stm32/libraries/HAL_Drivers/drv_usartX.c
    if (dma_cnt == 0)
    {
        rt_hw_serial_isr(&uart->serial, RT_SERIAL_EVENT_TX_DMADONE);
    }
}
#endif  /* RT_SERIAL_USING_DMA */

static const struct rt_uart_ops stm32_uart_ops =
{
    .init = stm32_init,
    .configure = stm32_configure,
    .control = stm32_control,
    .putc = stm32_putc,
    .getc = stm32_getc,
    .flush = stm32_flush,
    .start_tx = stm32_start_tx,
    .stop_tx = stm32_stop_tx,
#ifdef RT_SERIAL_USING_DMA
    .is_dma_txing = stm32_is_dma_txing,
    .start_dma_tx = stm32_start_dma_tx,
    .stop_dma_tx = stm32_stop_dma_tx,
#endif
    .enable_interrupt = stm32_enable_interrupt,
    .disable_interrupt = stm32_disable_interrupt,
};

int rt_hw_usart_init(void)
{
    rt_size_t obj_num = sizeof(uart_obj) / sizeof(struct stm32_uart);
    rt_err_t result = 0;

#ifdef RT_SERIAL_USING_DMA
    stm32_uart_get_dma_config();
#endif

    for (int i = 0; i < obj_num; i++)
    {
        /* init UART object */
        uart_obj[i].uart_config = &uart_config[i];
        uart_obj[i].serial.ops = &stm32_uart_ops;

        /* register UART device */
        result = rt_hw_serial_register(&uart_obj[i].serial, uart_obj[i].uart_config->name,
                                       RT_DEVICE_FLAG_RDWR
                                       | RT_DEVICE_FLAG_INT_RX
                                       | RT_DEVICE_FLAG_INT_TX
#ifdef RT_SERIAL_USING_DMA
                                       | uart_obj[i].uart_dma_flag
#endif
                                       , NULL);
        RT_ASSERT(result == RT_EOK);
    }

    return result;
}

#endif /* RT_USING_SERIAL */
